Hi,
I've just tried this fix and it still doesn't work. I've tried with both versions `2.57.0` and `2.58.0` just in case. 

With this fix, after doing the import and removing all unsettable fields, if we make any changes (e.g, tags in all three resources), when doing `terraform plan` we get the expected output 

`Plan: 0 to add, 3 to change, 0 to destroy`

But then when doing the actual `terraform apply` we get the following error:

```
Error: 'creation_source_database_id' is required for create_mode Secondary

  on main.tf line 47, in resource "azurerm_mssql_database" "secondary_db":
  47: resource "azurerm_mssql_database" "secondary_db" {
```

I tried setting `creation_source_database_id` to the id of the primary database. Then when applying the changes we get back to square one.

`Plan: 1 to add, 0 to change, 1 to destroy.`


```
Terraform will perform the following actions:

  # azurerm_mssql_database.secondary_db must be replaced
-/+ resource "azurerm_mssql_database" "secondary_db" {
        auto_pause_delay_in_minutes = 0
        collation                   = "SQL_Latin1_General_CP1_CI_AS"
        create_mode                 = "Secondary"
      + creation_source_database_id = "/subscriptions/899bf076-632b-4143-b015-43da8179e53f/resourceGroups/test-mssql-db-rg-1/providers/Microsoft.Sql/servers/fog-force-2-primary/databases/test-db-1" # forces replacement
        extended_auditing_policy    = []
        geo_backup_enabled          = true
      ~ id                          = "/subscriptions/899bf076-632b-4143-b015-43da8179e53f/resourceGroups/test-mssql-db-rg-1/providers/Microsoft.Sql/servers/fog-force-2-secondary/databases/test-db-1" -> (known after apply)
        license_type                = "LicenseIncluded"
        max_size_gb                 = 10
        min_capacity                = 0
        name                        = "test-db-1"
        read_replica_count          = 0
        read_scale                  = false
      + restore_point_in_time       = (known after apply)
      + sample_name                 = (known after apply)
        server_id                   = "/subscriptions/899bf076-632b-4143-b015-43da8179e53f/resourceGroups/test-mssql-db-rg-1/providers/Microsoft.Sql/servers/fog-force-2-secondary"
        sku_name                    = "GP_Gen5_2"
        storage_account_type        = "GRS"
      ~ tags                        = {
          + "sometag" = "somevalue"
        }
        zone_redundant              = false

      ~ long_term_retention_policy {
          ~ monthly_retention = "PT0S" -> (known after apply)
          ~ week_of_year      = 0 -> (known after apply)
          ~ weekly_retention  = "PT0S" -> (known after apply)
          ~ yearly_retention  = "PT0S" -> (known after apply)
        }

      ~ short_term_retention_policy {
          ~ retention_days = 7 -> (known after apply)
        }

      ~ threat_detection_policy {
          ~ disabled_alerts            = [] -> (known after apply)
          ~ email_account_admins       = "Disabled" -> (known after apply)
          ~ email_addresses            = [] -> (known after apply)
          ~ retention_days             = 0 -> (known after apply)
          ~ state                      = "Disabled" -> (known after apply)
          + storage_account_access_key = (sensitive value)
          + storage_endpoint           = (known after apply)
          + use_server_default         = (known after apply)
        }

        timeouts {}
    }
```


@aristovo This definitely took us one step further, maybe this can be fixed in the same way the `creationMode` was?
It looks like the `creation_source_database_id` field is not changeable in the provider. One solution might be to also set it alongside the `createMode` [here](https://github.com/aristosvo/terraform-provider-azurerm/blob/2f0d6adf942396d412e46bf4e7b09afb9a6177b0/azurerm/internal/services/mssql/mssql_database_resource.go#L55) .

Thanks all for your help!




